app/controllers/users_controller.rb

  def pets

    # Queries are here for clarity purposes in this demo
    # It's of course a better idea to create a method in your model

    if params[:id].present?
      pets = User.find(params[:id]).pets.find(:all) do
---
SELECT * FROM "pets" WHERE ("pets".user_id = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def post_data

    # It's of course your role to add security / validation here

    if params[:oper] == "del"
      User.find(params[:id]).destroy
    else
      user_params = { :pseudo => params[:pseudo], :firstname => params[:firstname], :lastname => params[:lastname],
                      :email => params[:email], :role => params[:role] }
      if params[:id] == "_empty"
        user = User.create(user_params)
      else
        user = User.find(params[:id])
        user.update_attributes(user_params)
---
DELETE FROM "users" WHERE "id" = 3
SELECT * FROM "users" WHERE ("users"."id" = 3)
INSERT INTO "users" ("pseudo", "updated_at", "role", "firstname", "lastname", "email", "created_at") VALUES('antho', '2009-04-12 15:45:09', 'test', 'anthony', 'Heukmes', 'anthony.heukmes@a-syst.com', '2009-04-12 15:45:09')
UPDATE "users" SET "pseudo" = 'willdalmat', "updated_at" = '2009-04-12 15:44:51' WHERE "id" = 2